import React from 'react'
import Header from '../../components/Header/Header'
import Footer from '../../components/Footer/Footer'
import Title from '../../components/Title/Title'
import Poster from '../../components/Poster/Poster'

const Activity = () => {

    const content = [
        {
            img: '/a-1.png',
            title: 'معرض العلوم السنويّ',
            content: 'معرض سنَويٌّ لطُلّابِنا لعرض مشاريعهم العلميّة المُبتَكرة. يُشجِّع المعرض على التفكير النَّقديِّ والبحث العِلميّ، ويَحتَفي بإبداعاتهم الفريدة في مُختلِفِ المجالات.'
        },
        {
            img: '/a-2.png',
            title: 'نادي البرمجة',
            content: 'في هذا النادي، نُعزِّزُ شغف البرمجة والتفكير الخوارزميِّ من خلال مسابقات وتحدِّيات شَيِّقة. يتعلّمُ الطلاب كيفية بناء حلول برمجيّة بأسلوب إبداعيّ، ممَّا يُؤَهِّلُهم ليكونوا قادة المستقبل في عالم التكنولوجيا.'
        },
        {
            img: '/a-3.png',
            title: 'معرض الفنون',
            content: 'مساحة حُرَّة لِطُلّابِنا للتّعبير عن أفكارهم ومشاعرهم من خلال الرسم والموسيقا. يعكس المعرض مَواهبَهُم الفنِّيَّة المُتَنوِّعة، ويحتفي بجمال الإبداع.'
        },
        {
            img: '/a-4.png',
            title: 'الأنشطة الرياضية',
            content: 'نُؤمِن بأنّ العقل السَّليم في الجسم السَّليم. نُقدِّمُ مجموعة مُتَنوِّعة من الأنشطة والبطولات الرياضيَّة التي تُعزِّز اللياقة البدنيَّة لدى طُلّابِنا، وتُنمِّي لديهم روح الفريق والمنافسة الشريفة.'
        },
        {
            img: '/a-5.png',
            title: 'الرِّحلات التعليميَّة والترفيهيَّة',
            content: 'نُنَظِّم رحلات دوريَّة تَهدِفُ إلى تَعزيزِ التَّعلُّمِ خارج الغُرفَةِ الصَّفِّيَّة. تجمع هذه الرِّحلات بين المُتعَةِ والفائدة، حيث يَكتَشِفُ الطلاب أماكن جديدة ويكتسبون خبرات عَمليَّة تُعَزِّزُ من معارفِهم.'
        },
    ]

  return (
    <>
        <Header img="url('/activity.png')" title='' desc='' />
        <Title title='النشاطات والفعاليات' desc='في مدرستنا، نؤمنُ بأنَّ التعليم يمتدُّ إلى ما هو أبعد من جُدرانِ الصَّفِّ.
             صفحة الأنشطة والفعاليات هي نافذَتُكُم للاطلاع على رِحلَتِنا المتكاملة في بناء شخصيَّة الطّالِبِ وتَنمية مواهبه.' />
        <div className='mt-[80px]'>
            <Poster content={content}/>
        </div>
        
        <Footer />
    </>
  )
}

export default Activity